# DataFrame

import pandas as pd
data = {
'이름' : ['강나래', '강태원', '강호림', '김수찬', '김재욱', '박동현', '박혜정', '승근열'],
'학교' : ['구로고', '구로고', '구로고', '구로고', '구로고', '디지털고', '디지털고', '디지털고'],
'키' : [197, 184, 168, 187, 188, 202, 188, 190],
'국어' : [90, 40, 80, 40, 15, 80, 55, 100],
'영어' : [85, 35, 75, 60, 20, 100, 65, 85],
'수학' : [100, 50, 70, 70, 10, 95, 45, 90],
'과학' : [95, 55, 80, 75, 35, 85, 40, 95],
'사회' : [85, 25, 75, 80, 10, 80, 35, 95],
'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}
df=pd.DataFrame(data,columns=["이름","국어","영어","수학","학교"])
print(df)
# print(df['키'])
# # print(df['과학'])
# print(df[['이름','국어']])
# print(df[['이름','국어']])

# data={
#     '학번':[1,2,3,4],
#     '이름':['홍길동','홍길자','홍길순','이순신'],
#     '국어':[100,90,80,70],
#     '영어':[100,90,80,70]
# }
# print(data)

# df=pd.DataFrame(data)
# print(df)